Tekla Open API Reference for Tekla Structures 2025
BaseWeld.ShopWeld Property
 Gets or sets a value indicating whether the weld is a shop weld (true) or a site weld (false).
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool ShopWeld { get; set; }
Public Property ShopWeld As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
BaseWeld Class
Tekla.Structures.Model Namespace